
<details><summary>Show Plan</summary>

``` terraform
terragrunt
[command]/home/runner/work/_temp/7e8799b0-4b3f-4acf-ac7e-3ee22d5fac1b/terraform-bin plan -input=false -no-color An execution plan has been generated and is shown below. Resource actions are indicated with the following symbols: + create <= read (data resources) Terraform will perform the following actions: # module.lambda.aws_ecr_repository.ecr will be created + resource "aws_ecr_repository" "ecr" { + arn = (known after apply) + id = (known after apply) + image_tag_mutability = "MUTABLE" + name = "refactor-hello_world" + registry_id = (known after apply) + repository_url = (known after apply) + image_scanning_configuration { + scan_on_push = true } } # module.lambda.aws_s3_bucket.b will be created + resource "aws_s3_bucket" "b" { + acceleration_status = (known after apply) + acl = "private" + arn = (known after apply) + bucket = "refactor-test-data" + bucket_domain_name = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + region = (known after apply) + request_payer = (known after apply) + website_domain = (known after apply) + website_endpoint = (known after apply) + server_side_encryption_configuration { + rule { + apply_server_side_encryption_by_default { + sse_algorithm = "AES256" } } } + versioning { + enabled = (known after apply) + mfa_delete = (known after apply) } } # module.lambda.null_resource.docker_build will be created + resource "null_resource" "docker_build" { + id = (known after apply) + triggers = { + "hash" = "fe3b4171e2f94d57271866dbaa31ab1e" } } # module.lambda.null_resource.docker_push will be created + resource "null_resource" "docker_push" { + id = (known after apply) } # module.lambda.null_resource.docker_tag will be created + resource "null_resource" "docker_tag" { + id = (known after apply) } # module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0] will be read during apply # (config refers to values not yet known) <= data "aws_iam_policy_document" "assume_role" { + id = (known after apply) + json = (known after apply) + statement { + actions = [ + "sts:AssumeRole", ] + effect = "Allow" + principals { + identifiers = [ + "lambda.amazonaws.com", ] + type = "Service" } } } # module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0] will be read during apply # (config refers to values not yet known) <= data "aws_iam_policy_document" "logs" { + id = (known after apply) + json = (known after apply) + statement { + actions = [ + "logs:CreateLogGroup", + "logs:CreateLogStream", + "logs:PutLogEvents", ] + effect = "Allow" + resources = [ + (known after apply), + (known after apply), ] } } # module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0] will be created + resource "aws_cloudwatch_log_group" "lambda" { + arn = (known after apply) + id = (known after apply) + name = "/aws/lambda/refactor-hello-lambda" + retention_in_days = 0 } # module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0] will be created + resource "aws_iam_policy" "logs" { + arn = (known after apply) + id = (known after apply) + name = "refactor-hello-lambda-logs" + path = "/" + policy = (known after apply) } # module.lambda.module.lambda_function_container_image.aws_iam_policy_attachment.logs[0] will be created + resource "aws_iam_policy_attachment" "logs" { + id = (known after apply) + name = "refactor-hello-lambda-logs" + policy_arn = (known after apply) + roles = [ + "refactor-hello-lambda", ] } # module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0] will be created + resource "aws_iam_role" "lambda" { + arn = (known after apply) + assume_role_policy = (known after apply) + create_date = (known after apply) + force_detach_policies = true + id = (known after apply) + managed_policy_arns = (known after apply) + max_session_duration = 3600 + name = "refactor-hello-lambda" + path = "/" + unique_id = (known after apply) + inline_policy { + name = (known after apply) + policy = (known after apply) } } # module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0] will be created + resource "aws_lambda_function" "this" { + arn = (known after apply) + description = "Hello world lambda" + function_name = "refactor-hello-lambda" + id = (known after apply) + image_uri = (known after apply) + invoke_arn = (known after apply) + last_modified = (known after apply) + memory_size = 128 + package_type = "Image" + publish = false + qualified_arn = (known after apply) + reserved_concurrent_executions = -1 + role = (known after apply) + signing_job_arn = (known after apply) + signing_profile_version_arn = (known after apply) + source_code_hash = (known after apply) + source_code_size = (known after apply) + timeout = 3 + version = (known after apply) + tracing_config { + mode = (known after apply) } } Plan: 10 to add, 0 to change, 0 to destroy. ------------------------------------------------------------------------ Note: You didn't specify an "-out" parameter to save this plan, so Terraform can't guarantee that exactly these actions will be performed if "terraform apply" is subsequently run. ::debug::Terraform exited with code 0. ::debug::stdout: 
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
 + create
 <= read (data resources)

Terraform will perform the following actions:

 # module.lambda.aws_ecr_repository.ecr will be created
 + resource "aws_ecr_repository" "ecr" {
 + arn = (known after apply)
 + id = (known after apply)
 + image_tag_mutability = "MUTABLE"
 + name = "refactor-hello_world"
 + registry_id = (known after apply)
 + repository_url = (known after apply)

 + image_scanning_configuration {
 + scan_on_push = true
 }
 }

 # module.lambda.aws_s3_bucket.b will be created
 + resource "aws_s3_bucket" "b" {
 + acceleration_status = (known after apply)
 + acl = "private"
 + arn = (known after apply)
 + bucket = "refactor-test-data"
 + bucket_domain_name = (known after apply)
 + bucket_regional_domain_name = (known after apply)
 + force_destroy = false
 + hosted_zone_id = (known after apply)
 + id = (known after apply)
 + region = (known after apply)
 + request_payer = (known after apply)
 + website_domain = (known after apply)
 + website_endpoint = (known after apply)

 + server_side_encryption_configuration {
 + rule {
 + apply_server_side_encryption_by_default {
 + sse_algorithm = "AES256"
 }
 }
 }

 + versioning {
 + enabled = (known after apply)
 + mfa_delete = (known after apply)
 }
 }

 # module.lambda.null_resource.docker_build will be created
 + resource "null_resource" "docker_build" {
 + id = (known after apply)
 + triggers = {
 + "hash" = "fe3b4171e2f94d57271866dbaa31ab1e"
 }
 }

 # module.lambda.null_resource.docker_push will be created
 + resource "null_resource" "docker_push" {
 + id = (known after apply)
 }

 # module.lambda.null_resource.docker_tag will be created
 + resource "null_resource" "docker_tag" {
 + id = (known after apply)
 }

 # module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0] will be read during apply
 # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role" {
 + id = (known after apply)
 + json = (known after apply)

 + statement {
 + actions = [
 + "sts:AssumeRole",
 ]
 + effect = "Allow"

 + principals {
 + identifiers = [
 + "lambda.amazonaws.com",
 ]
 + type = "Service"
 }
 }
 }

 # module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0] will be read during apply
 # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
 + id = (known after apply)
 + json = (known after apply)

 + statement {
 + actions = [
 + "logs:CreateLogGroup",
 + "logs:CreateLogStream",
 + "logs:PutLogEvents",
 ]
 + effect = "Allow"
 + resources = [
 + (known after apply),
 + (known after apply),
 ]
 }
 }

 # module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0] will be created
 + resource "aws_cloudwatch_log_group" "lambda" {
 + arn = (known after apply)
 + id = (known after apply)
 + name = "/aws/lambda/refactor-hello-lambda"
 + retention_in_days = 0
 }

 # module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0] will be created
 + resource "aws_iam_policy" "logs" {
 + arn = (known after apply)
 + id = (known after apply)
 + name = "refactor-hello-lambda-logs"
 + path = "/"
 + policy = (known after apply)
 }

 # module.lambda.module.lambda_function_container_image.aws_iam_policy_attachment.logs[0] will be created
 + resource "aws_iam_policy_attachment" "logs" {
 + id = (known after apply)
 + name = "refactor-hello-lambda-logs"
 + policy_arn = (known after apply)
 + roles = [
 + "refactor-hello-lambda",
 ]
 }

 # module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0] will be created
 + resource "aws_iam_role" "lambda" {
 + arn = (known after apply)
 + assume_role_policy = (known after apply)
 + create_date = (known after apply)
 + force_detach_policies = true
 + id = (known after apply)
 + managed_policy_arns = (known after apply)
 + max_session_duration = 3600
 + name = "refactor-hello-lambda"
 + path = "/"
 + unique_id = (known after apply)

 + inline_policy {
 + name = (known after apply)
 + policy = (known after apply)
 }
 }

 # module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0] will be created
 + resource "aws_lambda_function" "this" {
 + arn = (known after apply)
 + description = "Hello world lambda"
 + function_name = "refactor-hello-lambda"
 + id = (known after apply)
 + image_uri = (known after apply)
 + invoke_arn = (known after apply)
 + last_modified = (known after apply)
 + memory_size = 128
 + package_type = "Image"
 + publish = false
 + qualified_arn = (known after apply)
 + reserved_concurrent_executions = -1
 + role = (known after apply)
 + signing_job_arn = (known after apply)
 + signing_profile_version_arn = (known after apply)
 + source_code_hash = (known after apply)
 + source_code_size = (known after apply)
 + timeout = 3
 + version = (known after apply)

 + tracing_config {
 + mode = (known after apply)
 }
 }

Plan: 10 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

 ::debug::stderr: ::debug::exitcode: 0 ::set-output name=stdout::
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
 + create
 <= read (data resources)

Terraform will perform the following actions:

 # module.lambda.aws_ecr_repository.ecr will be created
 + resource "aws_ecr_repository" "ecr" {
 + arn = (known after apply)
 + id = (known after apply)
 + image_tag_mutability = "MUTABLE"
 + name = "refactor-hello_world"
 + registry_id = (known after apply)
 + repository_url = (known after apply)

 + image_scanning_configuration {
 + scan_on_push = true
 }
 }

 # module.lambda.aws_s3_bucket.b will be created
 + resource "aws_s3_bucket" "b" {
 + acceleration_status = (known after apply)
 + acl = "private"
 + arn = (known after apply)
 + bucket = "refactor-test-data"
 + bucket_domain_name = (known after apply)
 + bucket_regional_domain_name = (known after apply)
 + force_destroy = false
 + hosted_zone_id = (known after apply)
 + id = (known after apply)
 + region = (known after apply)
 + request_payer = (known after apply)
 + website_domain = (known after apply)
 + website_endpoint = (known after apply)

 + server_side_encryption_configuration {
 + rule {
 + apply_server_side_encryption_by_default {
 + sse_algorithm = "AES256"
 }
 }
 }

 + versioning {
 + enabled = (known after apply)
 + mfa_delete = (known after apply)
 }
 }

 # module.lambda.null_resource.docker_build will be created
 + resource "null_resource" "docker_build" {
 + id = (known after apply)
 + triggers = {
 + "hash" = "fe3b4171e2f94d57271866dbaa31ab1e"
 }
 }

 # module.lambda.null_resource.docker_push will be created
 + resource "null_resource" "docker_push" {
 + id = (known after apply)
 }

 # module.lambda.null_resource.docker_tag will be created
 + resource "null_resource" "docker_tag" {
 + id = (known after apply)
 }

 # module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0] will be read during apply
 # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role" {
 + id = (known after apply)
 + json = (known after apply)

 + statement {
 + actions = [
 + "sts:AssumeRole",
 ]
 + effect = "Allow"

 + principals {
 + identifiers = [
 + "lambda.amazonaws.com",
 ]
 + type = "Service"
 }
 }
 }

 # module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0] will be read during apply
 # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
 + id = (known after apply)
 + json = (known after apply)

 + statement {
 + actions = [
 + "logs:CreateLogGroup",
 + "logs:CreateLogStream",
 + "logs:PutLogEvents",
 ]
 + effect = "Allow"
 + resources = [
 + (known after apply),
 + (known after apply),
 ]
 }
 }

 # module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0] will be created
 + resource "aws_cloudwatch_log_group" "lambda" {
 + arn = (known after apply)
 + id = (known after apply)
 + name = "/aws/lambda/refactor-hello-lambda"
 + retention_in_days = 0
 }

 # module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0] will be created
 + resource "aws_iam_policy" "logs" {
 + arn = (known after apply)
 + id = (known after apply)
 + name = "refactor-hello-lambda-logs"
 + path = "/"
 + policy = (known after apply)
 }

 # module.lambda.module.lambda_function_container_image.aws_iam_policy_attachment.logs[0] will be created
 + resource "aws_iam_policy_attachment" "logs" {
 + id = (known after apply)
 + name = "refactor-hello-lambda-logs"
 + policy_arn = (known after apply)
 + roles = [
 + "refactor-hello-lambda",
 ]
 }

 # module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0] will be created
 + resource "aws_iam_role" "lambda" {
 + arn = (known after apply)
 + assume_role_policy = (known after apply)
 + create_date = (known after apply)
 + force_detach_policies = true
 + id = (known after apply)
 + managed_policy_arns = (known after apply)
 + max_session_duration = 3600
 + name = "refactor-hello-lambda"
 + path = "/"
 + unique_id = (known after apply)

 + inline_policy {
 + name = (known after apply)
 + policy = (known after apply)
 }
 }

 # module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0] will be created
 + resource "aws_lambda_function" "this" {
 + arn = (known after apply)
 + description = "Hello world lambda"
 + function_name = "refactor-hello-lambda"
 + id = (known after apply)
 + image_uri = (known after apply)
 + invoke_arn = (known after apply)
 + last_modified = (known after apply)
 + memory_size = 128
 + package_type = "Image"
 + publish = false
 + qualified_arn = (known after apply)
 + reserved_concurrent_executions = -1
 + role = (known after apply)
 + signing_job_arn = (known after apply)
 + signing_profile_version_arn = (known after apply)
 + source_code_hash = (known after apply)
 + source_code_size = (known after apply)
 + timeout = 3
 + version = (known after apply)

 + tracing_config {
 + mode = (known after apply)
 }
 }

Plan: 10 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

 ::set-output name=stderr:: ::set-output name=exitcode::0
```

</details>

Pusher: @jperson